package com.azn.tracking_volunteer_hours.email;

public class BuildEmailMessage {
    public static String buildEmailHonors(String name) {
        return "<div style=\"font-family:Helvetica,Arial,sans-serif;font-size:16px;margin:0;color:#0b0c0c;background-color:#f6f8fa;padding:20px\">\n" +
                "\n" +
                "  <div style=\"font-size:28px;font-weight:bold;color:#ffffff;text-align:center;margin-bottom:10px;background-color:#000000;height:50px;line-height:50px\">\n" +
                "    <span style=\"color:#ffffff;\">ЗАТВЕРДЖЕНО</span>\n" +
                "  </div>\n" +
                "\n" +
                "  <div style=\"font-size:19px;line-height:25px;color:#0b0c0c;margin-bottom:20px\">\n" +
                "    Указом Президента України<br>\n" +
                "    від 5 грудня 2022 року № 825/2022<br><br>\n" +
                "    ПОЛОЖЕННЯ<br><br>\n" +
                "    про відзнаку Президента України \"Золоте серце\"<br><br>\n" +
                "    1. Відзнакою Президента України \"Золоте серце\" (далі - відзнака) нагороджуються громадян (ка) України – " + name+ ", за те, що зробив (ла) вагомий внесок у надання волонтерської допомоги та розвиток волонтерського руху, зокрема під час здійснення заходів із забезпечення оборони України, захисту безпеки населення та інтересів держави у зв'язку з військовою агресією Російської Федерації проти України та подолання її наслідків.<br><br>\n" +
                "    2. Нагородження відзнакою може бути проведено посмертно.<br><br>\n" +
                "    3. Нагородження відзнакою проводиться Указом Президента України.<br><br>\n" +
                "    4. Одна й та сама особа може бути нагороджена відзнакою не більше одного разу.<br><br>\n" +
                "    5. Представлення до нагородження відзнакою проводиться відповідно до Порядку представлення до нагородження та вручення державних нагород України, затвердженого Указом Президента України від 19 лютого 2003 року № 138/2003.<br><br>\n" +
                "    6. Вручення відзнаки провадиться в урочистій обстановці Президентом України або від його імені керівниками центральних органів виконавчої влади, державних органів, що здійснюють керівництво утвореними відповідно до законів військовими формуваннями, керівниками інших державних органів, головами обласних та Київської міської державних адміністрацій, керівниками закордонних дипломатичних установ України.<br><br>\n" +
                "    7. Відзнака виготовляється із позолоченого срібла і має вигляд стилізованого зображення серця, утвореного зігнутою пластиною з отворами. Крізь отвори пропущені синя та жовта нитки, які перехрещуються.<br><br>\n" +
                "    Розміри відзнаки: висота - 40 мм, ширина - 30 мм.<br><br>\n" +
                "    На зворотному боці відзнаки - застібка для прикріплення до одягу.<br><br>\n" +
                "    8. Особі, нагородженій відзнакою, разом із відзнакою вручається документ, що посвідчує нагородження.<br><br>\n" +
                "    9. Відзнаку носять на грудях зліва і за наявності у нагородженого інших державних нагород України розміщують після них.<br><br>\n" +
                "    Керівник Офісу<br>\n" +
                "    Президента України<br>\t\n" +
                "    А. ЄРМАК\n" +
                "  </div>\n" +
                "\n" +
                "</div>";
    }


}
